Revit 2026 API

# FamilyLoadingIntoDocumentEventArgs Properties

---

The FamilyLoadingIntoDocumentEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | FamilyName | The file name of the family that is being loaded into the document. |
|  | FamilyPath | The file path of the family that is being loaded into the document. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

FamilyLoadingIntoDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace